app/views/carts/_cart.html.erb

SELECT  1 AS one FROM "line_items"  WHERE "line_items"."cart_id" = $1 LIMIT 1  [["cart_id", 5]]
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = $1  [["cart_id", 11]]
---
<% unless cart.line_items.empty? %>