app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-04-01 14:19:01.284811"], ["updated_at", "2014-04-01 14:19:01.284811"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 1], ["created_at", "2014-04-01 14:19:01.325971"], ["product_id", 5], ["updated_at", "2014-04-01 14:19:01.325971"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = 16  [["quantity", 2], ["updated_at", "2014-04-29 14:03:42.365717"]]