app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-03-04 14:52:51.151704"], ["description", "test"], ["image_url", "test"], ["price", "1.0"], ["title", "test"], ["updated_at", "2014-03-04 14:52:51.151704"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save