app/views/store/index.html.erb

<h1>The Awesome Catalog</h1>
<% cache ['store', Product.latest] do %>
---
SELECT  "products".* FROM "products"   ORDER BY "products"."updated_at" DESC LIMIT 1